Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоСериям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуги</Name>
					<Comment>(удалить, заменен на ТипНоменклатуры)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретОтгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Блок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппыДляКонструктора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТелеграм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПодбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПодбораНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьИзАссортимента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСвойства</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеСвойства</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеСвойства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затрата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СвойстваНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеСвойства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Номенклатура/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ глПриСозданииНаСервереЭлемент(ЭтаФорма, Объект) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	// © Primus1C  17.01.2024  НАЧАЛО ►
	Если Объект.Блок И НЕ (РольДоступна("БлокИзмененияНоменклатуры") ИЛИ РольДоступна("Администратор")) Тогда
		ТолькоПросмотр = Истина;  
	Иначе
		Элементы.Наименование.Доступность = РольДоступна("Администратор")
											ИЛИ РольДоступна("ИзменениеНоменклатуры")  
											ИЛИ РольДоступна("БлокИзмененияНоменклатуры")
											ИЛИ РольДоступна("Телеграм");
	КонецЕсли;  
	ЗаполнитьКэшСвойств(); 
	ОтобразитьСпецификацию();
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

// © Primus1C  18.01.2024  НАЧАЛО ►

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)  
	
	Если НЕ ЗначениеЗаполнено(КэшСвойств) Тогда
	   ЗаполнитьКэшСвойств();
    КонецЕсли;
	ПослеЗаписиНаСервере(Объект.Ссылка, КэшСвойств); 
		
    ОтобразитьСпецификацию();

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	КонструкторНаименований(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКонструктора(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;  

	Элементы.Наименование.ВыделенныйТекст = Результат.Наименование; 
	
	//КэшСвойств = Новый Структура;
	Для каждого текРезультат Из Результат Цикл
		Если текРезультат.Ключ = "Наименование" Тогда
			Продолжить;
		КонецЕсли; 
		Если КэшСвойств.Свойство(текРезультат.Ключ) Тогда
			КэшСвойств.Вставить(текРезультат.Ключ, текРезультат.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОшибкеКонструктора(Результат, ДопПараметры) Экспорт
	
КонецПроцедуры	

&НаСервере
Функция РодителиНоменклатурыСтрокой(Знач РодительЭлемента) 
	
	//Если РодительЭлемента.pr_ИсключатьИзКонструктора Тогда
	//	Результат = "";
	//Иначе
		Результат = СокрЛП(РодительЭлемента.Наименование);
	//КонецЕсли;	
	Пока ЗначениеЗаполнено(РодительЭлемента.Родитель) Цикл
		РодительЭлемента = РодительЭлемента.Родитель;	
		//Если НЕ РодительЭлемента.pr_ИсключатьИзКонструктора Тогда
			Результат = СокрЛП(РодительЭлемента.Наименование) + " " + Результат; 
		//КонецЕсли;
	КонецЦикла;
	Возврат СокрЛП(Результат);

КонецФункции 

&НаСервереБезКонтекста
Процедура ПослеЗаписиНаСервере(Номенклатура, КэшСвойств)
	
	// заполним спецификацию  
	
	Свойство = ПланыВидовХарактеристик.ДополнительныеСвойства.Спецификация;
	Имя = Номенклатура.Наименование;
	СтрСпецификация = "";	
	Если Сред(Имя, СтрДлина(Имя)-2, 1) = " " Тогда
		СтрСпецификация	= Прав(Имя, 2); 
	Иначе
		Поз = СтрНайти(Имя, " (Asis"); 
		Если Поз = 0 Тогда
			Поз = СтрНайти(Имя, " (RFB"); 
		КонецЕсли;
		//Если Поз = 0 Тогда
		//	Поз = СтрНайти(Имя, " (..."); 
		//КонецЕсли;
		Если Поз > 0 Тогда
			СтрСпецификация = Сред(Имя, Поз-2, 2); 
		КонецЕсли;
	КонецЕсли;   
	
	Если СтрСпецификация = "" Тогда	
		СписСпецификаций = ОбщегоНазначенияПовтИсп.СписокСпецификаций();
		Для каждого Эл Из СписСпецификаций Цикл 
			Если СтрДлина(Эл.Значение) <> 2 Тогда
				Поз = СтрНайти(Имя, " ", НаправлениеПоиска.СКонца);
				Если Поз > 0 Тогда
					СтрСпецификация = Сред(Имя, Поз+1);
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;		
	
	Если СтрСпецификация <> "" Тогда	
		Спецификация = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрСпецификация, Истина, , Свойство);
		Если Спецификация <> Неопределено Тогда
			Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
			Запись.Объект	= Номенклатура;
			Запись.Свойство	= Свойство;
			Запись.ЗначениеСвойства = Спецификация;      
			Запись.Записать();  
			КэшСвойств.Вставить(Свойство, Спецификация);
		КонецЕсли;
	КонецЕсли;	
	
	// удалим свойства с незаполненными значениями
	Для каждого Свойство Из КэшСвойств Цикл
		НоваяЗапись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		Если ЗначениеЗаполнено(Свойство.Значение) Тогда
			НоваяЗапись.Объект 				= Номенклатура;
			НоваяЗапись.Свойство 			= ПланыВидовХарактеристик.ДополнительныеСвойства.НайтиПоНаименованию(Свойство.Ключ);
			НоваяЗапись.ЗначениеСвойства	= Свойство.Значение;
			НоваяЗапись.Записать();
		Иначе
			НоваяЗапись.Объект 				= Номенклатура;
			НоваяЗапись.Свойство 			= ПланыВидовХарактеристик.ДополнительныеСвойства.НайтиПоНаименованию(Свойство.Ключ);
			НоваяЗапись.Прочитать();
			НоваяЗапись.Удалить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэшСвойств()

	КэшСвойств = Новый Структура;
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("ВидНоменклатуры", ОбщегоНазначенияСервер.ВидНоменклатуры(Объект.Ссылка));
	Запр.Текст = "ВЫБРАТЬ
	             |	ВидыНоменклатурыСвойстваНоменклатуры.Свойство КАК Свойство,
	             |	ВидыНоменклатурыСвойстваНоменклатуры.Свойство.Наименование КАК Наименование,
	             |	ВидыНоменклатурыСвойстваНоменклатуры.Свойство.ИмяПредопределенныхДанных КАК ИмяСвойства
	             |ИЗ
	             |	Справочник.ВидыНоменклатуры.СвойстваНоменклатуры КАК ВидыНоменклатурыСвойстваНоменклатуры
	             |ГДЕ
	             |	ВидыНоменклатурыСвойстваНоменклатуры.Ссылка = &ВидНоменклатуры";
    Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если ЗначениеЗаполнено(Выборка.ИмяСвойства) Тогда
	    	КэшСвойств.Вставить(Выборка.ИмяСвойства);  	
		Иначе
	    	КэшСвойств.Вставить(СтрЗаменить(Выборка.Наименование," ", "_"));  	
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)

	ЗаполнитьКэшСвойств();

КонецПроцедуры

&НаКлиенте
Процедура КонструкторНаименований(Команда)

	//Если НЕ РольДоступна("Разработка") Тогда
	//	клЗаглушкаВРазработке("Конструктор наименования");
	//	Возврат;
	//КонецЕсли;
	
	ПараметрыВвода = Новый Структура("Родители, ВидНоменклатуры, Номенклатура", РодителиНоменклатурыСтрокой(Объект.Родитель), Объект.ВидНоменклатуры, Объект.Ссылка);    
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораКонструктора", ЭтотОбъект, , "ПриОшибкеКонструктора", ЭтотОбъект);
	ОткрытьФорму("Справочник.Номенклатура.Форма.КонструкторНаименования", ПараметрыВвода,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображение()
	
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
		Элементы.Статья.Видимость = Ложь;
		Элементы.ГруппаТовар.Видимость = Истина;
	Иначе
		Элементы.Статья.Видимость = Истина;
		Элементы.ГруппаТовар.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)

	ОбновитьОтображение();

КонецПроцедуры

&НаСервере
Процедура ОтобразитьСпецификацию()
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Объект", Объект.Ссылка);
	Запр.УстановитьПараметр("ИмяСвойства", "Спецификация");
	Запр.Текст = "ВЫБРАТЬ
	             |	ЗначенияСвойствОбъектов.ЗначениеСвойства КАК ЗначениеСвойства
	             |ИЗ
	             |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	             |ГДЕ
	             |	ЗначенияСвойствОбъектов.Объект = &Объект
	             |	И ЗначенияСвойствОбъектов.Свойство.Наименование = &ИмяСвойства";
    Выборка = Запр.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ИндексКартинки = ОбщегоНазначения.ИндексКартинкиСпецификации(Выборка.ЗначениеСвойства);
	Иначе
		ИндексКартинки = -1; 
	КонецЕсли;
    
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
